---
kind: other
id: Methods.T:Autodesk.Revit.DB.Analysis.EnergyAnalysisOpening
source: html/9ef1411f-4b8e-858b-99f6-7db84fbb8a7f.htm
---
# EnergyAnalysisOpening Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.